src/InformationRegisters/РегистрацияПакетовИнформационногоОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияПакетовИнформационногоОбмена</Name>
			<Comment>Регистрация пакетов информационного обмена</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияФайла</Name>
					<Comment>Дата формирования файла</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбмена</Name>
					<Comment>Имя файла обмена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Comment>Файл обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументФормирования</Name>
					<Comment>Документ формирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.АктОказанияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерПакета</Name>
					<Comment>Номер пакета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РегистрацияПакетовИнформационногоОбмена/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

///
// Функция ПолучитьСледующийНомерПакетаОтчетногоПериода()
//     получает новый номер пакета информационного обмена
//
// Параметры
//  Период  - Дата 
//          период среза
///  Источник  - СправочникСсылка.Орагнизации
//          орагнизация, отправившая файл.
//  Получатель  - СправочникСсылка.Контрагенты
//          СМО, получившее файл
//
// Возвращаемое значение:
//   Число - следующий номер пакета
///
Функция ПолучитьСледующийНомерПакетаОтчетногоПериода(Период, Источник, Получатель) Экспорт
	
	НомерПакета = 1;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(РегистрацияПакетовИнформационногоОбменаСрезПоследних.НомерПакета) КАК НомерПакета
			|ИЗ
			|	РегистрСведений.РегистрацияПакетовИнформационногоОбмена.СрезПоследних(
			|			&Период,
			|			Источник = &Источник
			|				И Получатель = &Получатель) КАК РегистрацияПакетовИнформационногоОбменаСрезПоследних";
			
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Получатель", Получатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МаксимальныйНомер = ?(ЗначениеЗаполнено(Выборка.НомерПакета), Выборка.НомерПакета, 0);
		Возврат МаксимальныйНомер + 1;
	КонецЦикла;
	
	Возврат НомерПакета;
	
КонецФункции

///
// Функция ПроверитьРегистрациюДокумента()
//    проверяет зарегистрирован ли документ
//
// Параметры
//  ДокументСсылка  - Документ.РеестрОказаннойПомощи 
//      документ реестра.
//
// Возвращаемое значение:
//   Булево - если зарегистрирован то Истина.
///
Функция ПроверитьРегистрациюДокумента(ДокументСсылка, Входящий = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РегистрацияПакетовИнформационногоОбмена.Период,
			|	РегистрацияПакетовИнформационногоОбмена.НомерПакета,
			|	РегистрацияПакетовИнформационногоОбмена.Источник,
			|	РегистрацияПакетовИнформационногоОбмена.Получатель,
			|	РегистрацияПакетовИнформационногоОбмена.ДатаФормированияФайла,
			|	РегистрацияПакетовИнформационногоОбмена.ИмяФайлаОбмена,
			|	РегистрацияПакетовИнформационногоОбмена.ФайлОбмена,
			|	РегистрацияПакетовИнформационногоОбмена.ДокументФормирования
			|ИЗ
			|	РегистрСведений.РегистрацияПакетовИнформационногоОбмена КАК РегистрацияПакетовИнформационногоОбмена
			|ГДЕ
			|	РегистрацияПакетовИнформационногоОбмена.ДокументФормирования = &ДокументФормирования
			|	И РегистрацияПакетовИнформационногоОбмена.Источник = &Источник
			|	И РегистрацияПакетовИнформационногоОбмена.Получатель = &Получатель";
			
	Источник = ?(Входящий = Истина, ДокументСсылка.Контрагент, ДокументСсылка.СтруктурнаяЕдиница.Организация);
	Получатель = ?(Входящий = Истина, ДокументСсылка.СтруктурнаяЕдиница.Организация, ДокументСсылка.Контрагент);
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("ДокументФормирования", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

///
// Процедура РегистрацияПакетаОбмена()
//    регистрирует пакет обмена
//
// Параметры
//  Период  - Дата 
//      период регистрации пакета
//  НомерПакета  - Число 
//      номер пакета обмена
//  ДокументСсылка  - Документ.РеестрОказаннойПомощи 
//      документ реестра.
//  ФайлСсылка  - СправочникСсылка.Файлы 
//      файл обмена.
//
///
Процедура РегистрацияПакетаОбмена(Период, ДокументСсылка, ФайлСсылка, Входящий) Экспорт
	
	Источник    = ?(Входящий, ДокументСсылка.Контрагент, ДокументСсылка.СтруктурнаяЕдиница.Организация);
	Получатель  = ?(Входящий, ДокументСсылка.СтруктурнаяЕдиница.Организация, ДокументСсылка.Контрагент);
	НомерПакета = ПолучитьСледующийНомерПакетаОтчетногоПериода(Период, Источник, Получатель);
	
	НаборЗаписей_ = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.СоздатьНаборЗаписей();
	НаборЗаписей_.Отбор.НомерПакета.Установить(НомерПакета);
	НаборЗаписей_.Отбор.Период.Установить(НачалоМесяца(Период));
	НаборЗаписей_.Отбор.Источник.Установить(Источник);
	НаборЗаписей_.Отбор.Получатель.Установить(Получатель);
	// Для отлавливания возможных ошибок дублирования записей регистра прочитаем,
	// если такая строка уже буде существовать, то возникнет исключение.
	НаборЗаписей_.Прочитать();
	
	Запись = НаборЗаписей_.Добавить();
	Запись.Период = Период;
	Запись.ДокументФормирования = ДокументСсылка.Ссылка;
	Запись.НомерПакета = НомерПакета; // следующий номер
	Запись.Источник = Источник;
	Запись.Получатель = Получатель;
	Запись.ДатаФормированияФайла = ТекущаяДатаСеанса();
	Запись.ФайлОбмена = ФайлСсылка;
	Запись.ИмяФайлаОбмена = ФайлСсылка.Наименование;
	
	НаборЗаписей_.Записать(Истина);
	
	// в документе для записей устанавливаем флаг ПередачаОсуществлялась
	УстановитьЗначениеРеквизитаПередачаОсуществлялась(ДокументСсылка, Истина);
	
	Если Входящий Тогда
		// регистрируем суммы принятые к оплате по сулчаем и всему счету
		РегистрацияОтветаКонтрагента(ДокументСсылка, ФайлСсылка);
	КонецЕсли;
	
КонецПроцедуры

///
// Процедура ОтменаРегистрацииПакетаОбмена()
//    удаляет регистрацию пакета
//
// Параметры
//  Период  - Дата 
//      период регистрации пакета
//  НомерПакета  - Число 
//      номер пакета обмена
//
// Возвращаемое значение:
//   Булево - если зарегистрирован то Истина.
///
Процедура ОтменаРегистрацииПакетаОбмена(Период, НомерПакета, Источник, Получатель, Входящий) Экспорт
	
	НаборЗаписей_ = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена.СоздатьНаборЗаписей();
	НаборЗаписей_.Отбор.НомерПакета.Установить(НомерПакета);
	НаборЗаписей_.Отбор.Период.Установить(Период);
	НаборЗаписей_.Отбор.Источник.Установить(Источник);
	НаборЗаписей_.Отбор.Получатель.Установить(Получатель);
	НаборЗаписей_.Прочитать();
	Для каждого Запись Из НаборЗаписей_ Цикл
		// в документе для записей снимаем флаг ПередачаОсуществлялась
		УстановитьЗначениеРеквизитаПередачаОсуществлялась(Запись.ДокументФормирования, Ложь);
		Если Входящий Тогда
			// в документе отменяем регистрацию сумм счета и случаев
			ОтменаРегистрацииОтветаКонтрагента(Запись.ДокументФормирования);
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей_.Очистить();
	НаборЗаписей_.Записать();
	
КонецПроцедуры

// Процедура: ОтменаРегистрацииОтветаКонтрагента
//   отменяет регистрацию документа в регистре.
//
// Параметры:
//   ДокументСсылка{ДокументСсылка.РеестрОказаннойПомощи}
//     ссылка на документ, регистрацию которого необходимо отменить.
//
// Возвращаемое значение:
//   Истина - если отмена регистрации прошла успешно.
///
Функция ОтменаРегистрацииОтветаКонтрагента(ДокументСсылка) Экспорт
	
	Попытка
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		
		Если ДокументОбъект.Санкции.Количество() > 0 Тогда
			ДокументОбъект.Санкции.Очистить();
		КонецЕсли;
		
		// Заполним счет
		Если ЗначениеЗаполнено(ДокументОбъект.СуммаПринятаяКОплате) Тогда
			ДокументОбъект.СуммаПринятаяКОплате = 0;
			ЕстьИзменения = Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ДокументОбъект.СуммаСанкций) Тогда
			ДокументОбъект.СуммаСанкций = 0;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		// Заполним случаи
		Для каждого Лечение Из ДокументОбъект.Случаи Цикл
			Если ЗначениеЗаполнено(Лечение.СуммаПринятаяКОплате) Тогда
				Лечение.СуммаПринятаяКОплате = 0;
				ЕстьИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Лечение.ТипОплаты) Тогда
				Лечение.ТипОплаты = 0;
				ЕстьИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Лечение.СуммаСанкций) Тогда
				Лечение.СуммаСанкций = 0;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			ДокументОбъект.Записать();
		КонецЕсли; 
	Исключение
		ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция ОбработатьИнформациюОбОшибке()
//     из информации об ошибке формирует сообщение пользователю
//     пока что только для нарушений типа, возможно расширение.
//
// Параметры
//  ИнформацияОбОшибке  - ИнформацияОбОшибке
//         сведения об ошибке.
//
// Возвращаемое значение:
//   Строка   - текст ошибки
///
Функция ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке, СтруктураОшибки = Неопределено)
	
	Если СтруктураОшибки = Неопределено Тогда
		СтруктураОшибки = Новый Структура("Атрибут,Значение,ОписаниеОшибки",
										Неопределено,Неопределено, "");
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ИнформацияОбОшибке.Описание) Тогда
		Если Найти(ИнформацияОбОшибке.Описание,"Ошибка при установке значения атрибута контекста") <> 0 Тогда
			ВырезкаАтрибута = СтрЗаменить(ИнформацияОбОшибке.Описание,"Ошибка при установке значения атрибута контекста","");
			ВырезкаАтрибута = СтрЗаменить(ВырезкаАтрибута,"(","");
			ВырезкаАтрибута = СтрЗаменить(ВырезкаАтрибута,")","");
			ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаАтрибута));
			СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
			СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Проверка свойства") <> 0 Тогда
			НачалоВырезка_ = Найти(ИнформацияОбОшибке.Описание, "Проверка свойства");
			ВырезкаБезЛево_ = Сред(ИнформацияОбОшибке.Описание, НачалоВырезка_);
			КонецСвойства_ = Найти(ВырезкаБезЛево_, ":");
			ВырезкаАтрибута = Сред(ИнформацияОбОшибке.Описание, НачалоВырезка_ + 19, КонецСвойства_ - 21);
			ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаАтрибута));
			СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
			СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Значение:") <> 0 Тогда
			ВырезкаMinLength = Сред(
									ИнформацияОбОшибке.Описание,
									Найти(ИнформацияОбОшибке.Описание,"Значение:")
									);
			ВырезкаMinLength = Сред(ВырезкаMinLength, Найти(ВырезкаMinLength,"'"));
			ВырезкаMinLength = Сред(ВырезкаMinLength,0,Найти(ВырезкаMinLength,"'"));
			СтруктураОшибки.Значение = СокрЛП(ВырезкаMinLength);
		КонецЕсли;
		Если Найти(ИнформацияОбОшибке.Описание,"Ошибка проверки данных XDTO") <> 0 Тогда
			НеЗаполненоСвойство_ = Найти(ИнформацияОбОшибке.Описание,"Не установлено значение одного из следующих свойств");
			Если НеЗаполненоСвойство_ <> 0 Тогда
				ВырезкаИмениСвойства = Сред(
										ИнформацияОбОшибке.Описание,
										НеЗаполненоСвойство_ + 53
										);
				ДанныеАтрибута = ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(СокрЛП(ВырезкаИмениСвойства));
				СтруктураОшибки.Атрибут = ДанныеАтрибута.Представление;
				СтруктураОшибки.ОписаниеОшибки = ДанныеАтрибута.ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ИнформацияОбОшибке.Причина) = Тип("ИнформацияОбОшибке") Тогда
		ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке.Причина, СтруктураОшибки);
	КонецЕсли;
	Если СтруктураОшибки.Атрибут <> Неопределено Тогда
		Текст = "Значение '" + 
				?(ЗначениеЗаполнено(СтруктураОшибки.Значение),СтруктураОшибки.Значение,"Пусто") + 
				"' реквизита '" +
				СтруктураОшибки.Атрибут + 
				"' не соответствует его типу." + ?(ЗначениеЗаполнено(СтруктураОшибки.ОписаниеОшибки), Символы.ПС + СтруктураОшибки.ОписаниеОшибки, "");
				
	Иначе
		Текст = ИнформацияОбОшибке.Описание;
	КонецЕсли; 
	
	Возврат Текст;
	
КонецФункции

// Функция ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена()
//     
//
// Параметры
//  ИмяАтрибута  - Строка
//         сведения об ошибке
//
// Возвращаемое значение:
//   Строка   - Представление атрибута, найденное в макете.
///
Функция ПолучитьПредставлениеПоИмениАтрибутаФайлаОбмена(ИмяАтрибута)
	
	Описание = Новый Структура("Представление,ОписаниеОшибки", "Имя атрибута не определено", "");
	РегОбмена = РегистрыСведений.РегистрацияПакетовИнформационногоОбмена;
	ТекстXML = РегОбмена.ПолучитьМакет("ОписаниеПолейВыгрузки").ПолучитьТекст();
	МакетТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ТекстXML).Данные;
	Поиск = МакетТаблица.НайтиСтроки(Новый Структура("ИмяЭлемента", ИмяАтрибута));
	Если Поиск.Количество() > 0  Тогда
		ЗаполнитьЗначенияСвойств(Описание, Поиск[0]);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

//   Процедура УстановитьЗначениеРеквизитаПередачаОсуществлялась
//     устанавливает значение реквизита ПередачаОсуществлялась в ТЧ Записи
//
//  Параметры
//   ДокументСсылка  - {ДокументСсылка.РеестрОказаннойПомощи}
//        документ, записи которого надо пометить как уже переданные.
//   Значение - {Булево}
//      значение реквизита ПередачаОсуществлялась.
///
Процедура УстановитьЗначениеРеквизитаПередачаОсуществлялась(ДокументСсылка, Значение) Экспорт
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ЕстьИзменения = Ложь;
	//Для каждого СтрокаТЧПрием Из ДокументОбъект.Записи Цикл
	//	Если СтрокаТЧПрием.ПередачаОсуществлялась <> Значение Тогда
	//		СтрокаТЧПрием.ПередачаОсуществлялась = Значение;
	//		ЕстьИзменения = Истина;
	//	КонецЕсли; 
	//КонецЦикла; 
	Если ЕстьИзменения Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение)
	КонецЕсли; 
	
КонецПроцедуры

// Процедура: РегистрацияОтветаКонтрагента
//   Регистрирует ответ контрагента в регистре
// 
// Параметры:
//   ДокументСсылка{ДокументСсылка.РеестрОказаннойПомощи}
//     ссылка на документ, который необходимо зарегистрировать.
//
// Возвращаемое значение:
//   Истина - если регистрация прошла успешно.
///
Функция РегистрацияОтветаКонтрагента(ДокументСсылка, ФайлСсылка) Экспорт
	
	МассивФайловДляУдаления = Новый Массив();
	ВременныйКаталог = КаталогВременныхФайлов();
	// проверка на существование файла /////////////////////////////////////////////
	
	ДанныеОФайле=РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(ФайлСсылка);
	АдресФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьНавигационнуюСсылкуДляОткрытия(ДанныеОФайле.Версия);
	
	ПутьКФайлуАрхива = ВременныйКаталог + ДанныеОФайле.ПолноеНаименованиеВерсии;
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуАрхива);
	МассивФайловДляУдаления.Добавить(ПутьКФайлуАрхива);
	
	ФайлОбмена = Новый Файл(ПутьКФайлуАрхива);
	
	Если НЕ ФайлОбмена.Существует() Тогда
		ПоказатьСообщение("ФормированиеРеестровСчетов_ФайлНеСуществует");
		Возврат Ложь;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////
	
	ИмяФайлаБезРаширения = ФайлОбмена.ИмяБезРасширения;
	РасширениеФайла = ФайлОбмена.Расширение;
	
	// проверка возможности распаковки /////////////////////////////////
	ПутьРаспаковки = ВременныйКаталог + ИмяФайлаБезРаширения;
	Архив = РаспаковатьАрхив(ПутьКФайлуАрхива, ПутьРаспаковки);
	Если Архив = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	МассивФайловДляУдаления.Добавить(ПутьРаспаковки);
	///////////////////////////////////////////////////////////////////////////////
	
	Для каждого ЭлементАрхива Из Архив.Элементы Цикл
		Префикс = Лев(ЭлементАрхива.Имя, 1);
		ПутьКФайлуАрхива = ПутьРаспаковки +"\" + ЭлементАрхива.Имя;
		Если Префикс = "H" Тогда
			РегистрацияОтветаКонтрагента_ZL_LIST(ДокументСсылка, ПутьКФайлуАрхива);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьФайлыПоМассивуПутей(МассивФайловДляУдаления);
	
	Возврат Истина;
	
КонецФункции

// Процедура: УдалитьФайлыПоМассивуПутей
//   удаляет временные файлы.
// 
// Параметры:
//   Массив{Массив}
//     массив путей удаления
///
Процедура УдалитьФайлыПоМассивуПутей(МассивПутей) Экспорт
	
	// удаление созданного распаковкой каталога
	Попытка
		Для каждого ФайлПуть Из МассивПутей Цикл
			УдалитьФайлы(ФайлПуть);
		КонецЦикла; 
	Исключение
		ПоказатьСообщение("ФормированиеРеестровСчетов_ОшибкаУдаленияПроверяемогоАрхива");
	КонецПопытки;
	
КонецПроцедуры

// Процедура: РегистрацияОтветаКонтрагента_ZL_LIST
//   Заполняет документ ответом от контрагента
// 
// Параметры:
//   ДокументСсылка{ДокументСсылка.РеестрОказаннойПомощи}
//     ссылка на документ данные которого необходимо заполнить ответом.
//   ПутьКФайлу  - Строка
//         путь к файлу
//
// Возвращаемое значение:
//   Истина - если регистрация прошла успешно.
///
Функция РегистрацияОтветаКонтрагента_ZL_LIST(ДокументСсылка, ПутьКФайлу)
	
	
	ЧтениеXML_ = Новый ЧтениеXML();
	ЧтениеXML_.ОткрытьФайл(ПутьКФайлу,,,"windows-1251");
	Попытка
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(
						ЧтениеXML_,
						ТипFFOMS("ZL_LIST")
					);
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		// Заполним счет
		Если ОбъектXDTO.SCHET.SUMMAP <> Неопределено ИЛИ
			 ЗначениеЗаполнено(ДокументОбъект.СуммаПринятаяКОплате)
		Тогда
			ДокументОбъект.СуммаПринятаяКОплате = ОбъектXDTO.SCHET.SUMMAP;
			ЕстьИзменения = Истина;
		КонецЕсли; 
		Если ОбъектXDTO.SCHET.SANK <> Неопределено ИЛИ
			 ЗначениеЗаполнено(ДокументОбъект.СуммаСанкций)
		Тогда
			ДокументОбъект.СуммаСанкций = ОбъектXDTO.SCHET.SANK;
			ЕстьИзменения = Истина;
		КонецЕсли; 
		
		// Заполним случаи
		Для каждого ЭлементZAP Из ОбъектXDTO.ZAP Цикл
			Для каждого ЭлементSLUCH Из ЭлементZAP.SLUCH Цикл
				СтрокиТЧ = ДокументОбъект.Случаи.НайтиСтроки(
											Новый Структура("РеестровыйНомерСлучая",
															  ЭлементSLUCH.IDCASE
															)
										);
				Если СтрокиТЧ.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли; 
				СтрокаТЧ = СтрокиТЧ[0];
				Если ЭлементSLUCH.SUMP <> Неопределено ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.СуммаПринятаяКОплате)
				Тогда
					СтрокаТЧ.СуммаПринятаяКОплате = ЭлементSLUCH.SUMP;
					ЕстьИзменения = Истина;
				КонецЕсли;
				Если ЭлементSLUCH.OPLATA <> Неопределено ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.ТипОплаты)
				Тогда
					СтрокаТЧ.ТипОплаты = ЭлементSLUCH.OPLATA;
					ЕстьИзменения = Истина;
				КонецЕсли;
				СтрокаREFREASON = "";
				Для каждого ЭлементREFREASON Из ЭлементSLUCH.REFREASON Цикл
					Если ЭлементREFREASON <> Неопределено Тогда
						СтрокаREFREASON = СтрокаREFREASON + 
										?(ПустаяСтрока(СтрокаREFREASON),"",",") +
										Строка(ЭлементREFREASON);
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(СтрокаREFREASON) ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.ПричинаОтказаВОплате)
				Тогда
					СтрокаТЧ.ПричинаОтказаВОплате = СтрокаREFREASON;
					ЕстьИзменения = Истина;
				КонецЕсли;
				Если ЭлементSLUCH.SANK_MEK <> Неопределено ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.СуммаСанкцийМЭК)
				Тогда
					СтрокаТЧ.СуммаСанкцийМЭК = ЭлементSLUCH.SANK_MEK;
					ЕстьИзменения = Истина;
				КонецЕсли;
				Если ЭлементSLUCH.SANK_MEE <> Неопределено ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.СуммаСанкцийМЭЭ)
				Тогда
					СтрокаТЧ.СуммаСанкцийМЭЭ = ЭлементSLUCH.SANK_MEE;
					ЕстьИзменения = Истина;
				КонецЕсли;
				Если ЭлементSLUCH.SANK_EKMP <> Неопределено ИЛИ
					 ЗначениеЗаполнено(СтрокаТЧ.СуммаСанкцийЭКМП)
				Тогда
					СтрокаТЧ.СуммаСанкцийЭКМП = ЭлементSLUCH.SANK_EKMP;
					ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			ДокументОбъект.Записать();
		КонецЕсли; 
	Исключение
		Рез = ОбработатьИнформациюОбОшибке(ИнформацияОбОшибке());
		Сообщение_ = Новый СообщениеПользователю;
		Сообщение_.Текст = Рез;
		Сообщение_.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

 // Процедура: ТипFFOMS
 //   Получает тип XDTO по имени типа из пространства имен ffoms:order:79:2011-04-07
 // 
 // Параметры:
 ///
Функция ТипFFOMS(ИмяТипа, Фабрика_XDTO = Неопределено) Экспорт
	
	ПространствоИмен = "ffoms:order:79:2011-04-07";
	
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	Иначе
		Возврат Фабрика_XDTO.Пакеты.Получить(ПространствоИмен).Получить(ИмяТипа);
	КонецЕсли;
	
КонецФункции


// Процедура: РаспаковатьАрхив
//   распаковывает файлы
// 
// Параметры:
//   ПутьКФайлуАрхива  - Строка
//         путь к файлу архива
//   ПутьРаспаковки  - Строка
//         путь куда распаковать архив
//
// Возвращаемое значение:
//   ЧтениеZipФайла - Неопределено если возникли ошибки извлечения.
///
Функция РаспаковатьАрхив(ПутьКФайлуАрхива, ПутьРаспаковки) Экспорт
	
	Попытка
		Архив = Новый ЧтениеZipФайла();
		Архив.Открыть(ПутьКФайлуАрхива);
		Индекс = 2;
		ПутьРаспаковкиВрем = ПутьРаспаковки;
		Пока Истина Цикл
			Каталог = Новый Файл(ПутьРаспаковкиВрем);
			Если Каталог.Существует() Тогда
				ПутьРаспаковкиВрем = ПутьРаспаковки + "(" + Формат(Индекс, "ЧГ=") + ")";
				Индекс = Индекс + 1;
			Иначе
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		ПутьРаспаковки = ПутьРаспаковкиВрем;
		СоздатьКаталог(ПутьРаспаковки);
		Архив.ИзвлечьВсе(ПутьРаспаковки);
	Исключение
		ПоказатьСообщение("ФормированиеРеестровСчетов_ПриИзвлеченииАрхиваВозниклиОшибки");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Архив;
	
КонецФункции

 // Процедура: ПоказатьСообщение
 //   выводит сообщение пользователю на указанным языке.
 //
 // Параметры:
 //   ИмяСообщения {Строка}
 //     Имя сообщения строкой.
 //   Параметры
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   Язык {Строка}
 //     Код языка для работы с НСтр.
 //
 ///
Процедура ПоказатьСообщение(
	Знач ИмяСообщения,
	Знач Параметры = Неопределено,
	Знач Язык = ""
) 
	Перем
		Сообщение,
		СтруктураСообщения
	;
	Сообщение = Новый СообщениеПользователю;
	ТекстСообщения = ПолучитьСообщение(ИмяСообщения, Параметры, Истина, Язык);
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

 // Функция: Получить
 //   возвращает текст и заголовок сообщения пользователю, соответствующего
 //   имени сообщения в справочнике.
 //
 // Параметры:
 //   ИмяСообщения {Строка}
 //     Имя сообщения строкой.
 //   Параметры
 //     Структура, которая хранит значения по ключам. Каждое вхождение подстроки вида
 //     #Ключ#, где Ключ - это ключ структуры, будет заменено на значение по этому ключу.
 //     Параметр не обязательный.
 //   ТолькоТекст {Булево}
 //     Определяет возвращаемое значение. Если Ложь, то вернется структура.
 //   Язык {Строка}
 //     Код языка для работы с НСтр.
 //
 // Возврат:
 //   {Строка, Структура}
 //        Текст сообщения или структура с двумя полями: Текст и Заголовок
 ///
Функция ПолучитьСообщение(
	Знач ИмяСообщения,
	Знач Параметры = Неопределено,
	Знач ТолькоТекст = Истина,
	Знач Язык = ""
) Экспорт
	
	СообщениеСтруктура = ПолучитьПовтИсп(ИмяСообщения, Язык);
	Сообщение = Новый Структура(СообщениеСтруктура);
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Для Каждого Параметр Из Параметры Цикл
			Шаблон = "#" + Параметр.Ключ + "#";
			Замена = Параметр.Значение;
			Сообщение.Текст = СтрЗаменить(Сообщение.Текст, Шаблон, Замена);
		КонецЦикла;
	КонецЕсли;
	
	Если ТолькоТекст = Истина Тогда
		Возврат Сообщение.Текст;
	Иначе
		Возврат Сообщение;
	КонецЕсли;
	
КонецФункции

 // Функция: Получить
 //   Получает сообщение пользователю по заданному идентификатору.
 //
 // Параметры:
 //   ИмяСообщения{Строка}
 //        Имя сообщения для получения
 //   Язык{Строка}
 //        Код языка, для получения строки НСтр
 //
 // Возврат: {Строка}
 ///
Функция ПолучитьПовтИсп(Знач ИмяСообщения, Знач КодЯзыка = "") Экспорт
	
	Сообщение = Новый Структура("Текст, Заголовок, Описание");
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	СообщенияПользователю.Наименование КАК Заголовок,
				|	СообщенияПользователю.ТекстНСтр КАК Текст,
				|	СообщенияПользователю.Описание
				|ИЗ
				|	Справочник.СообщенияПользователю КАК СообщенияПользователю
				|ГДЕ
				|	СообщенияПользователю.ПометкаУдаления = ЛОЖЬ
				|	И СообщенияПользователю.ИмяСообщения = &ИмяСообщения";
		Запрос.УстановитьПараметр("ИмяСообщения", ИмяСообщения);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Сообщение, Выборка);
			Сообщение.Текст = НСтр(Сообщение.Текст, КодЯзыка);
		Иначе
			ВызватьИсключение НСтр("ru='Неизвестное сообщение!'");
		КонецЕсли;
		
	Исключение
		
		Сообщение.Текст = НСтр("ru='Неизвестное сообщение: " + ИмяСообщения + "'");
		Сообщение.Заголовок = НСтр("ru='Неизвестное сообщение!'");
		
	КонецПопытки;
	
	Результат = Новый ФиксированнаяСтруктура(Сообщение);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
